[
  {
    "img_src": "https://imgur.com/FVK9QmN.png",
    "title": "Bravo",
    "git_link": "https://github.com/bravolabs",
    "deploy_link": "https://saybravo.io/",
    "short_desc": "Bravo is an employee recognition and incentive platform aimed at small to medium-sized teams built in 8 weeks with 8 developers",
    "article": "## Introduction \n Bravo is a platform for organizations and their members where they can share their appreciation for each other. We have provided both a slack application and web application to make it easy for users to receive and give praise, whatever their workflow. \n\n Our stack is Slack app running from the Slack API, Express and PostgreSQL on Node.JS for our backend, and ReactJS with Redux for our front end. \n ## Team Workflow \n To organize our team workflow, we used Trello as our primary task management tool. \nWe followed a release cycle of a release every 2 weeks, with the aim to push major sections and numerous features each iteration.\n\n As a team, we worked really well when it came to segregating workflows and fixing problems with the proposed features. We had team meetings twice a day with 1 on 1’s once a week and quickly came to understand each other's workflows. We did have issues at the beginning with conflicting features and duplicated work, but overcame this with better organization and communication.\n ## Project Overview\n [Trello Board](https://trello.com/b/RmnRC4ez/labs) \n[Product Canvas](https://www.notion.so/Acknowledge-Coworkers-in-Slack-96c60f39816b477d9b81fe5d97a992ee) \n[UX Design files](https://www.figma.com/file/SbSjn8oAUtdWY1slSJeP9u/Bravo) \n\nHealthy office cultures often acknowledge good work from their coworkers and peers. Award your peers with acknowledgments that act like coins/points in Slack when they do awesome things - and never let the acknowledgment of their good work get lost in the shuffle again.\n ### Key Features \n -    Users can send public shoutouts to their teammates for their good work in Slack\n -    Users can see all the shoutouts for given teammate in Slack\n -    For every shoutout, comment or reaction to shoutout users get bravos\n -    Users can see how many bravos they have in their wallet in Slack\n -    Users can see their Slack workspace leaderboard in Slack \n## Tech Stack \n #### [Back end](https://github.com/bravolabs/bravo-be) built using: \n-    _NodeJS (Express)_ \n-    _PostgreSQL_ \n #### [Front end](https://github.com/bravolabs/bravo-fe) built using: \n - _React_\n - _Slack API Auth_\n - _Styled-Components_"
  },
  {
    "img_src": "https://imgur.com/C6uYsJN.png",
    "title": "Water My Plants",
    "git_link": "https://github.com/bw-water-my-plants",
    "deploy_link": "https://water-my-plants-554a4.firebaseapp.com/",
    "short_desc": "Water My Plants is a plant watering reminder and scheduler built by a team of 3 at Lambda School in 1 week",
    "article": "## Introduction \n Building a schedule around ensuring that all your plants are watered is actually pretty difficult. Water My Plants helps to solve those problems by providing and easy to use interface for creating a plant watering schedule that will remind users to water their plants on a regular basis.\n ## Project Overview \n This was a build week project during our time at Lambda, and was built with 3 developers in only 4 days. 1 on backend and 2 on frontend (I worked on frontend).\n This was a really fun project. Unfortunately we didn't get time to make it responsive so the web app only functions properly on mobile. However we did get text reminders working and the mobile view turned out really well. This is definetly a project I'll be coming back to when I have time.  \n ## Tech Stack \n #### [Backend](https://github.com/bw-water-my-plants/water-my-plants-BE) built using:\n - _Express.js_ \n - _Knex_ \n - _PostgreSQL DB_ \n - _jsonwebtoken_ \n - _Jest_ \n - _Twilio_ \n #### [Frontend](https://github.com/bw-water-my-plants/water-my-plants-FE/blob/master/water-plants) built using:\n - _ReactJS_ \n - _Redux_ \n - _Axios_ \n - _Styled-Components_"
  },
  {
    "img_src": "https://imgur.com/NjLjiJS.png",
    "title": "Sleep Tracker",
    "git_link": "https://github.com/build-week-sleep-tracker",
    "deploy_link": "https://bw-sleep-tracker-fe.netlify.com/",
    "short_desc": "Sleep Tracker is an app enabling users to track their sleep and receive feedback and recommendations on their sleep patterns. This was built by 6 developers in 1 week"
  },
  {
    "img_src": "https://imgur.com/nCcmSTl.png",
    "title": "Wunderlist 2.0",
    "git_link": "https://github.com/team-wunderlist",
    "short_desc": "This was my first build week at Lambda School. We were tasked with creating a list-keeping app to help manage people tasks throughout the day. I created the landing page and part of the React app"
  },
  {
    "img_src": "https://imgur.com/qwJuxrO.png",
    "title": "[ARRAY]",
    "git_link": "https://github.com/arrayhackathon2019",
    "short_desc": "Array is a social media platform for software engineers and coders alike. This was a concept project built in 48 hours during the Lambda Hackathon 2019 with a team of 5 developers"
  },
  {
    "img_src": "https://imgur.com/gx6TFJP.png",
    "title": "Treasure Hunt",
    "git_link": "https://github.com/cseu2bw/CS-Build-Week-2",
    "short_desc": "As part of our last build week during the Computer Science module, we were tasked to create a program to traverse and complete actions in a treasure hunt game"
  }
]